Tekla Open API Reference for Tekla Structures 2025
PickerInterruptedException Class
 The PickerInterruptedException class defines the exception that is thrown when a user interrupts the picker.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.PickerInterruptedException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PickerInterruptedException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class PickerInterruptedException
	Inherits TeklaStructuresDrawingsApplicationException
The PickerInterruptedException type exposes the following members.
Constructors
Name | Description
PickerInterruptedException
 Creates a new picker interrupted exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace